In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = pd.read_csv('census02.csv')

In [3]:
data.head()

,House Number,Street,First Name,Surname,Age,Relationship to Head of House,Marital Status,Gender,Occupation,Infirmity,Religion
0,1,Kaur Drive,Douglas,Adams,77.0,Head,Widowed,Male,Retired Museum education officer,NaN,Christian
1,2,Kaur Drive,Hollie,West,79.0,Head,Single,Female,Retired Dealer,NaN,Christian
2,3,Kaur Drive,Joseph,Hall,55.0,Head,Single,Male,Fast food restaurant manager,NaN,Christian
3,4,Kaur Drive,Gregory,Cox,35.0,Head,Single,Male,Housing manager/officer,NaN,NaN
4,5,Kaur Drive,Lydia,Jones,42.0,Head,Single,Female,Unemployed,NaN,Catholic

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10118 entries, 0 to 10117
Data columns (total 11 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   House Number                   10118 non-null  int64
 1   Street                         10118 non-null  object
 2   First Name                     10118 non-null  object
 3   Surname                        10118 non-null  object
 4   Age                            10118 non-null  float64
 5   Relationship to Head of House  9356 non-null   object
 6   Marital Status                 7634 non-null   object
 7   Gender                         10118 non-null  object
 8   Occupation                     10118 non-null  object
 9   Infirmity                      84 non-null     object
 10  Religion                       4123 non-null   object
dtypes: float64(1), int64(1), object(9)
memory usage: 869.6+ KB

In [6]:
data.isnull().sum()

House Number                         0
Street                               0
First Name                           0
Surname                              0
Age                                  0
Relationship to Head of House      762
Marital Status                    2484
Gender                               0
Occupation                           0
Infirmity                        10034
Religion                          5995
dtype: int64

In [7]:
# for people with missing values in the 'Marital Status' column, we will fill the missing values with 'Underage' for people under 18

data.loc[(data['Marital Status'].isnull()) & (data['Age'] < 18), 'Marital Status'] = 'Underage'

In [11]:
data['Marital Status'].isnull().sum()

0

In [12]:
data.isnull().sum()

House Number                         0
Street                               0
First Name                           0
Surname                              0
Age                                  0
Relationship to Head of House      762
Marital Status                       0
Gender                               0
Occupation                           0
Infirmity                        10034
Religion                          5995
dtype: int64